---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.CurrentUserAddinsLocation
source: html/1a3bd77e-f671-8d1a-d9d5-dbf61389f240.htm
---
# Autodesk.Revit.ApplicationServices.Application.CurrentUserAddinsLocation Property

The folder location for .addin files for the current user.

## Syntax (C#)
```csharp
public string CurrentUserAddinsLocation { get; }
```